using Grayscale.P219_Move_______.L___500_Struct;

namespace Grayscale.P218_Starlight__.L___500_Struct
{

    /// <summary>
    /// 星の光。
    /// 
    /// 通常、今の星の位置を示していますが、拡張バージョンでは、前の星の位置も示すようになります。
    /// </summary>
    public interface DoubleBusstopable
    {
        /// <summary>
        /// ------------------------------------------------------------------------------------------------------------------------
        /// 先後、升、配役
        /// ------------------------------------------------------------------------------------------------------------------------
        /// </summary>
        Busstop Now { get; }
    }
}
